## dev: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 4 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                   NAME                                    |
|----------|---------------------------------------------------------------------------|
| add      | `aws_cloudwatch_log_subscription_filter.postgresql_dangerous_queries[0]`  |
|          | `aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |
| update   | `aws_rds_cluster.notification-canada-ca`                                  |
|          | `aws_rds_cluster_instance.notification-canada-ca-instances[0]`            |
|          | `aws_rds_cluster_instance.notification-canada-ca-instances[1]`            |
|          | `aws_rds_cluster_instance.notification-canada-ca-instances[2]`            |
| recreate | `aws_secretsmanager_secret_version.database_user`                         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.postgresql_dangerous_queries[0] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "postgresql_dangerous_queries" {
      + destination_arn = "arn:aws:lambda:ca-central-1:800095993820:function:sentinel-cloud-watch-forwarder"
      + distribution    = "Random"
      + filter_pattern  = "[(w1=\"*ALTER *\" || w1=\"*CREATE *\" || w1=\"*DROP *\" || w1=\"*GRANT *\" || w1=\"*REVOKE *\" || w1=\"*TRUNCATE *\" || w1=\"*alter *\" || w1=\"*create *\" || w1=\"*drop *\" || w1=\"*grant *\" || w1=\"*revoke *\" || w1=\"*truncate *\")]"
      + id              = (known after apply)
      + log_group_name  = "/aws/rds/cluster/notification-canada-ca-dev-cluster/postgresql"
      + name            = "Postgresql dangerous queries"
      + role_arn        = (known after apply)
    }

  # aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sentinel-cloud-watch-forwarder"
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:800095993820:log-group:/aws/rds/cluster/notification-canada-ca-dev-cluster/postgresql:*"
      + statement_id        = "AllowExecutionFromCloudWatchLogs-sentinel-cloud-watch-forwarder-postgres"
      + statement_id_prefix = (known after apply)
    }

  # aws_rds_cluster.notification-canada-ca will be updated in-place
  ~ resource "aws_rds_cluster" "notification-canada-ca" {
      ~ deletion_protection                   = false -> true
      + enable_local_write_forwarding         = false
        id                                    = "notification-canada-ca-dev-cluster"
      ~ master_password                       = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ snapshot_identifier                   = (sensitive value)
        tags                                  = {
            "CostCenter" = "notification-canada-ca-dev"
        }
        # (50 unchanged attributes hidden)
    }

  # aws_rds_cluster_instance.notification-canada-ca-instances[0] will be updated in-place
  ~ resource "aws_rds_cluster_instance" "notification-canada-ca-instances" {
        id                                    = "notification-canada-ca-dev-instance-0"
      ~ instance_class                        = "db.t3.medium" -> "db.r6g.xlarge"
        tags                                  = {
            "CostCenter" = "notification-canada-ca-dev"
        }
        # (32 unchanged attributes hidden)
    }

  # aws_rds_cluster_instance.notification-canada-ca-instances[1] will be updated in-place
  ~ resource "aws_rds_cluster_instance" "notification-canada-ca-instances" {
        id                                    = "notification-canada-ca-dev-instance-1"
      ~ instance_class                        = "db.t3.medium" -> "db.r6g.xlarge"
        tags                                  = {
            "CostCenter" = "notification-canada-ca-dev"
        }
        # (32 unchanged attributes hidden)
    }

  # aws_rds_cluster_instance.notification-canada-ca-instances[2] will be updated in-place
  ~ resource "aws_rds_cluster_instance" "notification-canada-ca-instances" {
        id                                    = "notification-canada-ca-dev-instance-2"
      ~ instance_class                        = "db.t3.medium" -> "db.r6g.xlarge"
        tags                                  = {
            "CostCenter" = "notification-canada-ca-dev"
        }
        # (32 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.database_user must be replaced
-/+ resource "aws_secretsmanager_secret_version" "database_user" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:800095993820:secret:postgres_OlrUqI6c-3oClMB" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:800095993820:secret:postgres_OlrUqI6c-3oClMB|terraform-20240829140925284500000004" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240829140925284500000004" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.logs_exports"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.pgaudit"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_db_user"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_user"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_cloudwatch_log_group.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_only\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_write\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_iam_role.this[0]"]

36 tests, 19 passed, 17 warnings, 0 failures, 0 exceptions

```

</details>
